In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("TestData.csv")

In [4]:
df

,job_title,age,deptno,ename,joining_date,salary,city,gender,category,sales
0,Manager,30,1,Alice,2020-01-15,50000,New York,M,Electronics,1000
1,Engineer,25,1,Bob,2019-05-20,60000,Los Angeles,F,Clothing,500
2,Manager,35,2,Charlie,2021-03-30,55000,New York,M,Electronics,1500
3,Engineer,28,2,David,2018-08-12,70000,Chicago,F,Groceries,700
4,Manager,40,3,Eve,2020-11-10,60000,Los Angeles,M,Clothing,800

In [4]:
avgDf=df.groupby('job_title')['age'].median()

In [5]:
avgDf

job_title
Engineer    26.5
Manager     35.0
Name: age, dtype: float64

In [6]:
countDf = df.groupby('deptno').count()

In [7]:
countDf

        job_title  age  ename  joining_date  salary  city  gender
deptno
1               2    2      2             2       2     2       2
2               2    2      2             2       2     2       2
3               1    1      1             1       1     1       1

In [8]:
sortedDF = df.sort_values(by='joining_date', ascending=False)

In [9]:
sortedDF

  job_title  age  deptno    ename joining_date  salary         city gender
2   Manager   35       2  Charlie   2021-03-30   55000     New York      M
4   Manager   40       3      Eve   2020-11-10   60000  Los Angeles      M
0   Manager   30       1    Alice   2020-01-15   50000     New York      M
1  Engineer   25       1      Bob   2019-05-20   60000  Los Angeles      F
3  Engineer   28       2    David   2018-08-12   70000      Chicago      F

In [10]:
maxDF = df.groupby('deptno')['salary'].max();

In [11]:
maxDF

deptno
1    60000
2    70000
3    60000
Name: salary, dtype: int64

In [12]:
empCountDF=df.groupby('city').count()

In [13]:
empCountDF

             job_title  age  deptno  ename  joining_date  salary  gender
city
Chicago              1    1       1      1             1       1       1
Los Angeles          2    2       2      2             2       2       2
New York             2    2       2      2             2       2       2

In [7]:
df

,job_title,age,deptno,ename,joining_date,salary,city,gender,category,sales
0,Manager,30,1,Alice,2020-01-15,50000,New York,M,Electronics,1000
1,Engineer,25,1,Bob,2019-05-20,60000,Los Angeles,F,Clothing,500
2,Manager,35,2,Charlie,2021-03-30,55000,New York,M,Electronics,1500
3,Engineer,28,2,David,2018-08-12,70000,Chicago,F,Groceries,700
4,Manager,40,3,Eve,2020-11-10,60000,Los Angeles,M,Clothing,800

In [8]:
salDF = df.groupby('gender')['salary'].agg(['min','max'])

In [9]:
salDF

          min    max
gender
F       60000  70000
M       50000  60000

In [10]:
sumDf=df.groupby('category')['sales'].sum()

In [11]:
sumDf

category
Clothing       1300
Electronics    2500
Groceries       700
Name: sales, dtype: int64

In [12]:
avgSalDF=df.groupby('deptno')['salary'].mean()